#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРесурс(Команда)
	
	Защита = Неопределено;
	Если Объект.SSL Тогда
		Защита = Новый ЗащищенноеСоединениеOpenSSL;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Объект.Сервер, , СокрЛП(Объект.СерверЛогин), СокрЛП(Объект.СерверПароль), , Объект.Таймаут,Защита);
	
	httpЗапрос = Новый HTTPЗапрос(Объект.Адрес);
	Если Объект.Метод = "POST" Тогда
		httpзапрос.УстановитьТелоИзСтроки(Объект.СодержимоеМетодаПост);
		Для Каждого СтрокаЗаголовка ИЗ ЗаголовкиМетодаПост Цикл
			 httpзапрос.Заголовки.Вставить(СтрокаЗаголовка.Имя, СтрокаЗаголовка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		Результат =  Соединение.ВызватьHTTPМетод(Объект.Метод, httpЗапрос);
		
		РезультатКлиент = "Код состояния: " + Результат.КодСостояния + Символы.ПС + Результат.ПолучитьТелоКакСтроку();
	Исключение
		РезультатКлиент = "Ошибка открытия сайта, " + ОписаниеОшибки();
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ПримерКурсВалют(Команда)
		
	Объект.SSL = Истина;
	Объект.СерверЛогин = "frolov_a";
	Объект.СерверПароль = "1";
	Объект.Сервер = "currencyrates.1c.ru";
	Объект.Адрес  = "/exchangerate/v1/840.tsv";
	
	ОткрытьРесурс (Неопределено);
	//2
КонецПроцедуры
#КонецОбласти



